Revit 2026 API

# TagMode Enumeration

---

The modes of tag creation that are supported for IndependentTags.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum TagMode
```
```vb
Public Enumeration TagMode
```
```cpp
public enum class TagMode
```
```fsharp
type TagMode
```

| Member name | Value | Description |
| --- | --- | --- |
| TM_ADDBY_CATEGORY | 0 | Add a single category tag. |
| TM_ADDBY_MATERIAL | 2 | Add a material tag. |
| TM_ADDBY_MULTICATEGORY | 1 | Add a multi-category tag. |

#### Reference

Autodesk.Revit.DB Namespace